; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	infrared3 - mode
	infrared0 - mode
	spectrograph6 - mode
	image5 - mode
	image2 - mode
	image4 - mode
	image1 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation5 - direction
	Star3 - direction
	Star0 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image4)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(supports instrument2 image4)
	(supports instrument2 image5)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image2)
	(supports instrument3 image5)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star3)
	(supports instrument6 image2)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument7 spectrograph6)
	(calibration_target instrument7 Star0)
	(supports instrument8 spectrograph6)
	(supports instrument8 image2)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 image1)
	(supports instrument9 image2)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument10 image5)
	(supports instrument10 infrared3)
	(supports instrument10 image4)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
)
(:goal (and
	(pointing satellite1 Star2)
	(pointing satellite3 Phenomenon8)
	(pointing satellite4 GroundStation5)
	(have_image Phenomenon6 image5)
	(have_image Phenomenon7 spectrograph6)
	(have_image Phenomenon8 image5)
	(have_image Phenomenon8 infrared3)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon9 image4)
	(have_image Planet10 image5)
	(have_image Planet10 image1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 11
2. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 0 of 11
3. (turn_to satellite4 planet10 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 planet10)
   goals met: 0 of 11
4. (take_image satellite4 planet10 instrument10 image5)
   added: (have_image planet10 image5)
   goals met: 1 of 11
5. (turn_to satellite4 phenomenon9 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 11
6. (take_image satellite4 phenomenon9 instrument10 image4)
   added: (have_image phenomenon9 image4)
   goals met: 2 of 11
7. (turn_to satellite4 phenomenon6 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 11
8. (turn_to satellite3 groundstation4 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation4)
   goals met: 2 of 11
9. (take_image satellite4 phenomenon6 instrument10 image5)
   added: (have_image phenomenon6 image5)
   goals met: 3 of 11
10. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 3 of 11
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 11
12. (calibrate satellite3 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 3 of 11
13. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 3 of 11
14. (turn_to satellite1 planet10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet10)
   goals met: 3 of 11
15. (take_image satellite1 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 4 of 11
16. (turn_to satellite1 star2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star2)
   goals met: 5 of 11
17. (turn_to satellite3 phenomenon7 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon7)
   goals met: 5 of 11
18. (take_image satellite3 phenomenon7 instrument8 spectrograph6)
   added: (have_image phenomenon7 spectrograph6)
   goals met: 6 of 11
19. (turn_to satellite3 phenomenon9 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon9)
   goals met: 6 of 11
20. (take_image satellite3 phenomenon9 instrument8 image2)
   added: (have_image phenomenon9 image2)
   goals met: 7 of 11
21. (turn_to satellite3 phenomenon8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon8)
   goals met: 8 of 11
22. (turn_to satellite4 phenomenon8 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon8)
   goals met: 8 of 11
23. (take_image satellite4 phenomenon8 instrument10 image5)
   added: (have_image phenomenon8 image5)
   goals met: 9 of 11
24. (take_image satellite4 phenomenon8 instrument10 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 10 of 11
25. (turn_to satellite4 groundstation5 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 groundstation5)
   goals met: 11 of 11
